#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/abcea004-0e83-4518-a1e1-5bcfbb0c7e79/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.devops_vm[0].azurerm_role_assignment.vm_admin_role_assignment must be replaced
-/+ resource "azurerm_role_assignment" "vm_admin_role_assignment" {
      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/shared-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Compute/virtualMachines/vm-devops-dev/providers/Microsoft.Authorization/roleAssignments/f2e026d0-363c-61bf-9b76-6f4fc5f99763" -> (known after apply)
      ~ name                             = "f2e026d0-363c-61bf-9b76-6f4fc5f99763" -> (known after apply)
      ~ principal_id                     = "d3acf0ca-d629-423b-a06b-7fab838e7c5d" -> "bda41c64-1493-4d8d-b4b5-7135159d4884" # forces replacement
      ~ principal_type                   = "User" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.jumpbox_vm[0].azurerm_role_assignment.vm_admin_role_assignment must be replaced
-/+ resource "azurerm_role_assignment" "vm_admin_role_assignment" {
      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/shared-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Compute/virtualMachines/vm-jumpbox-dev/providers/Microsoft.Authorization/roleAssignments/2092f264-8305-4a03-fe8c-f0881043467c" -> (known after apply)
      ~ name                             = "2092f264-8305-4a03-fe8c-f0881043467c" -> (known after apply)
      ~ principal_id                     = "d3acf0ca-d629-423b-a06b-7fab838e7c5d" -> "bda41c64-1493-4d8d-b4b5-7135159d4884" # forces replacement
      ~ principal_type                   = "User" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.vnetSpoke[0].azurerm_subnet.this[0] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/network-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Network/virtualNetworks/secure-baseline-2-ase-wus2-vnet-lzademo-dev/subnets/hostingEnvironment"
        name                                           = "hostingEnvironment"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "Microsoft.Web/serverFarms"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/action",
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Web/hostingEnvironments"
            }
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  + shared-vms                   = {
      + devops  = {
          + id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/shared-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Compute/virtualMachines/vm-devops-dev"
          + ip = "10.0.2.4"
        }
      + jumpbox = {
          + id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/shared-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Compute/virtualMachines/vm-jumpbox-dev"
          + ip = "10.0.3.4"
        }
    }
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.devops_vm[0].azurerm_role_assignment.vm_admin_role_assignment must be replaced%0A-/+ resource "azurerm_role_assignment" "vm_admin_role_assignment" {%0A      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/shared-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Compute/virtualMachines/vm-devops-dev/providers/Microsoft.Authorization/roleAssignments/f2e026d0-363c-61bf-9b76-6f4fc5f99763" -> (known after apply)%0A      ~ name                             = "f2e026d0-363c-61bf-9b76-6f4fc5f99763" -> (known after apply)%0A      ~ principal_id                     = "d3acf0ca-d629-423b-a06b-7fab838e7c5d" -> "bda41c64-1493-4d8d-b4b5-7135159d4884" # forces replacement%0A      ~ principal_type                   = "User" -> (known after apply)%0A      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.jumpbox_vm[0].azurerm_role_assignment.vm_admin_role_assignment must be replaced%0A-/+ resource "azurerm_role_assignment" "vm_admin_role_assignment" {%0A      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/shared-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Compute/virtualMachines/vm-jumpbox-dev/providers/Microsoft.Authorization/roleAssignments/2092f264-8305-4a03-fe8c-f0881043467c" -> (known after apply)%0A      ~ name                             = "2092f264-8305-4a03-fe8c-f0881043467c" -> (known after apply)%0A      ~ principal_id                     = "d3acf0ca-d629-423b-a06b-7fab838e7c5d" -> "bda41c64-1493-4d8d-b4b5-7135159d4884" # forces replacement%0A      ~ principal_type                   = "User" -> (known after apply)%0A      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.vnetSpoke[0].azurerm_subnet.this[0] will be updated in-place%0A  ~ resource "azurerm_subnet" "this" {%0A        id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/network-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Network/virtualNetworks/secure-baseline-2-ase-wus2-vnet-lzademo-dev/subnets/hostingEnvironment"%0A        name                                           = "hostingEnvironment"%0A        # (9 unchanged attributes hidden)%0A%0A      ~ delegation {%0A            name = "Microsoft.Web/serverFarms"%0A%0A          ~ service_delegation {%0A              ~ actions = [%0A                  - "Microsoft.Network/virtualNetworks/subnets/action",%0A                  + "Microsoft.Network/virtualNetworks/subnets/join/action",%0A                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",%0A                ]%0A                name    = "Microsoft.Web/hostingEnvironments"%0A            }%0A        }%0A    }%0A%0APlan: 2 to add, 1 to change, 2 to destroy.%0A%0AChanges to Outputs:%0A  + shared-vms                   = {%0A      + devops  = {%0A          + id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/shared-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Compute/virtualMachines/vm-devops-dev"%0A          + ip = "10.0.2.4"%0A        }%0A      + jumpbox = {%0A          + id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/shared-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Compute/virtualMachines/vm-jumpbox-dev"%0A          + ip = "10.0.3.4"%0A        }%0A    }%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @JinLee794, Action: `pull_request`, Working Directory: `scenarios/secure-baseline-ase/terraform`, Workflow: `Scenario 2: Terraform Single-tenant ASEv3 Secure Baseline`*